araobp/stm32-mcu/NUCLEO-F401RE/NFC/NFC04A1_NDEF_URI/Drivers/BSP/NFC04A1/nfc04a1_conf_template.h
/**
 ******************************************************************************
 * @file    nfc04a1_conf.h
 * @author  MMY Application Team
 * @brief   This file contains definitions for the NFC4 components bus interfaces
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2018 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
#ifndef _NFC04A1_CONF_H_
#define _NFC04A1_CONF_H_

#include "stm32l4xx_hal.h"
#include "nucleo_l476rg_bus.h"
#include "nucleo_l476rg_errno.h"

/** @defgroup X_NUCLEO_NFC04A1_Exported_Constants
  * @{
  */
/* I/O Definition of ST25DV_NUCLEO board */
/* HAL connector names */
#define NFC04A1_GPO_PIN                   GPIO_PIN_6
#define NFC04A1_GPO_PIN_PORT              GPIOA
#define NFC04A1_LPD_PIN                   GPIO_PIN_8
#define NFC04A1_LPD_PIN_PORT              GPIOA
#define NFC04A1_LED1_PIN                  GPIO_PIN_4
#define NFC04A1_LED1_PIN_PORT             GPIOB
#define NFC04A1_LED2_PIN                  GPIO_PIN_5
#define NFC04A1_LED2_PIN_PORT             GPIOB
#define NFC04A1_LED3_PIN                  GPIO_PIN_10
#define NFC04A1_LED3_PIN_PORT             GPIOA

#define NFC04A1_GPO_EXTI                  EXTI9_5_IRQn
#define NFC04A1_GPO_IRQHandler            EXTI9_5_IRQHandler

#define NFC04A1_INIT_CLK_GPO_RFD()        __HAL_RCC_GPIOA_CLK_ENABLE( );
#define NFC04A1_INIT_CLK_LPD_RFD()        __HAL_RCC_GPIOA_CLK_ENABLE( );

/* Bus IO */
#define BSP_NFCTAG_I2C_Init         BSP_I2C1_Init
#define BSP_NFCTAG_I2C_DeInit       BSP_I2C1_DeInit;
#define BSP_NFCTAG_I2C_IsReady      BSP_I2C1_IsReady;
#define BSP_NFCTAG_I2C_ReadReg16    BSP_I2C1_ReadReg16;
#define BSP_NFCTAG_I2C_Recv         BSP_I2C1_Recv;
#define BSP_NFCTAG_I2C_WriteReg16   BSP_I2C1_WriteReg16;
#define BSP_NFCTAG_GetTick          HAL_GetTick;

#define BSP_NFCTAG_BUS_HANDLE       (hbusi2c1)
#define BSP_NFCTAG_INSTANCE         (0)

#define BSP_NFCTAG_GPO_PRIORITY     (0)
#define BSP_NFCTAG_GPO_EXTI_LINE    (EXTI_LINE_6)
/**
  * @}
  */


#endif /* _NFC04A1_CONF_H_ */
